package com.aitd.module_chat.lib.menu;
/**
 * 当前的类的功能描述 : 消息长按菜单内置类型
 */
public enum MenuType {

    //------------------------------------------公共----------------------------------------------
    /**
     * 回复
     */
    REPLY,
    /**
     * 转发
     */
    FORWARD,
    /**
     * 收藏
     */
    COLLECTION,

    /**
     * 多选
     */
    MUIT_CHOICE,
    /**
     * 撤销
     */
    REVOKE,

    /**
     * 删除
     */
    DELETE,

    //-------------------------------------------特殊---------------------------------------------
    /**
     * 添加表情
     */
    ADD_EMO,

    /**
     * 复制
     */
    COPY,

    //-------------------------------------------自定义---------------------------------------------
    /**
     * 自定义类型
     */
    CUSTOM;
}
